import 'package:techblog/Models/articles_blog_model.dart';
import 'package:techblog/Models/hashtags.dart';
import 'package:techblog/gen/assets.gen.dart';

Map homePagePosterMap = {
  'writername': 'محمدحسن قصابی',
  'timestr': "سه روز پیش",
  'likecountstr': "253",
  'likecountstrtext': "Like",
  'postercomments': "دوازده قدم برنامه نویسی یک دوره ی...س",
  'loadingpagetext': "در حال بارگذاری و ورود به اپلیکیشن...",
};
List<HashtagsList> tagsList = [
  HashtagsList(title: "جاوا"),
  HashtagsList(title: "برنامه نویسی وب"),
  HashtagsList(title: "پادکست رادیو کدیاد"),
  HashtagsList(title: "کاتلین"),
];

Map staticStrings = {
  'hotestWriten': 'مشاهده داغ ترین نوشته ها ',
  'hotestPodcast': 'مشاهده داغ ترین پادکست ها ',
};


List<ArticlesBlogModel> articlesList = [
  ArticlesBlogModel(
      imageUrlblog: Assets.images.img1.path,
      titleBlog: "سالیدیتی چیست؛ معرفی زبان معروف برنامه‌نویسی ...ع",
      writername: "ملیکا عزیزی",
      views: "like 235",
      content:
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، \nچاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد \nگذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، \n و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد \n استفاده قرار گیرد.",
      date: "2023-02-05"),
  ArticlesBlogModel(
      imageUrlblog: Assets.images.img2.path,
      titleBlog: "سالیدیتی چیست؛ معرفی زبان معروف برنامه‌نویسی ...ع",
      writername: "محمدحسن قصابی",
      views: "like 235",
      content:
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
      date: "2023-02-05"),
];
